{
  "description": "Below are listed our beliefs as a church. We hold these doctrinal truths as core values of our worship and everyday life as we grow in Christ.",
  "hero_image": "https://res.cloudinary.com/northside-baptist-church/image/upload/c_scale,f_auto,q_50,w_0.5/v1641495712/Stock/rod-long-DRgrzQQsJDA-unsplash_aefrcu.jpg",
  "belief_list": [
    {
      "belief_name": "God the Father",
      "description": "We believe that God the Father is perfect in holiness, infinite in wisdom, and measureless in power; that He concerns Himself mercifully in the affairs of men; that He hears and answers prayer; and that He saves from Hell all who come to Him through Jesus Christ.",
      "references": "Psalm 22:3; John 17:11; Psalm 147:5; I John 3:3; Matthew 19:26; John 3:16; Matthew 6:26, 28-30; Psalm 65:2; Hebrews 11:6: Romans 5:8: I Timothy 2:5: John 14:6.",
      "name": "God the Father"
    },
    {
      "belief_name": "Scriptures",
      "description": "We believe that the Scriptures of the Old and the New Testaments are plenarily and verbally-inspired by God without any admixture of error in truth; that the Bible is reliable in science, history and every other matter it discusses; and that the Bible is the supreme and final authority in all matters of faith and practice. \nII Timothy 3:16, 17; II Peter 1:19-21.",
      "references": "Psalm 22:3; John 17:11; Psalm 147:5; I John 3:3; Matthew 19:26; John 3:16; Matthew 6:26, 28-30; Psalm 65:2; Hebrews 11:6: Romans 5:8: I Timothy 2:5: John 14:6.",
      "name": "Scripture"
    },
    {
      "name": "God's Trinity",
      "description": "We believe in one Triune God, eternally existing in three Persons–Father, Son and Holy Spirit–co-eternal in being, co-identical in nature, co-equal in power and glory, and having the same attributes and perfections.",
      "references": "Exodus 20:2, 3; I John 5:7; Matthew 28:19, 20; II Corinthians 13:14; I Corinthians 8:6"
    },
    {
      "description": "We believe in the absolute Deity of the Lord Jesus Christ; His eternal existence as God, co-equal with the Father and the Holy Spirit; His incarnation by means of the virgin birth; His sinlessness; His vicarious death through the shedding of His blood as an atonement for the remission of our sins; His literal, bodily resurrection from the dead; His ascension; His present high-priestly ministry in Heaven for believers; and His personal, visible return to earth.",
      "references": " I John 5:20; John 1:18; John 14:9; Hebrews 1:8; Isaiah 7:14; Matthew 1:18-25; Luke 1:26-35; I Peter 2:22; Romans 3:25; Hebrews 9:14; Luke 24:36-43; Acts 10:40,41; Acts 1:9; Luke 24:51; Hebrews 8:1,2; I John 2:1; Acts 1:11; I Thessalonians 4:16",
      "name": "Jesus Christ"
    },
    {
      "description": "We believe that the Holy Spirit is a Divine Person, equal with the Father and Son and of the same nature; that He convicts the world of sin, righteousness and judgment; that he bears witness to the Truth; that He is the Agent of the New Birth; that He baptizes all true believers into the body of Christ, indwelling and sanctifying all of them, sealing and thus securing them unto the day of redemption; that He endues, guides, teaches, and helps believers; and that it is the privilege and duty of all the saved to be filled with the Spirit, the evidence being soul-winning power.",
      "name": "Holy Spirit",
      "references": "Matthew 28:19; I Corinthians 12:12-14; Acts 5:3, 4; John 16:7-15"
    },
    {
      "name": "Creation",
      "description": "We believe that the Godhead created the heavens (the universe) and the earth, including all life, each after its own species, by direct act and not by a process of evolution.",
      "references": "Genesis 1 and 2; Colossians 1:16, 17; John 1:3"
    },
    {
      "description": "We believe that man, in the person of the First Adam, was created in the image of God in innocence under the law of his Maker; that by reason of his voluntary sin, he fell from his innocent state; that as a result the whole race plunged into condemnation and death, so that now all human beings are born with a sinful nature; and that all who reach the age of moral understanding become willful sinners in thought, word, and deed, and so are without excuse before God.",
      "name": "Sin",
      "references": "Genesis 1:26, 27; Genesis 3; Romans 5:10-19: Psalm 51:5; Romans 1:18-32; Romans 3:10-23."
    },
    {
      "name": "Salvation by Grace",
      "description": "We believe that the salvation of sinners is wholly of grace through faith in the blood sacrifice, death and resurrection of the Lord Jesus Christ; that all who receive Him are regenerated by the Holy Spirit and become children of God; that no rite, ceremony, or work can avail for the sinner’s salvation; that Christ is the only and all-sufficient Savior; and that all who are truly saved are kept forever by the sacrificial and high-priestly work of Jesus.",
      "references": "Ephesians 2:8-9; Titus 3:5-7; John 5:24; John 1:12; Romans 10:9-13; Acts 16:31; Acts 4:12; II Timothy 1:12; John 10:28, 29; Romans 8:35-39; Philippians 1:6; Philemon 18 & 19; Hebrews 6:20; Hebrews 8:3-5; Hebrews 9:14-15; Hebrews 10:10"
    },
    {
      "name": "Sovereignty & Free Will",
      "description": "We believe that the blessings of salvation are made free to all by the Gospel; that it is the immediate duty of all to accept them by a cordial, penitent, and obedient faith; and that nothing prevents the salvation of the greatest sinner on earth but his personal rejection of the Gospel, which rejection involves him in an aggravated condemnation.",
      "references": "John 3:16-21; I Timothy 1:15; Hebrews 7: 25; Revelation 22:17; Ezekiel 33:11; John 5:40; II Peter 3:9; I Timothy 2:3, 4"
    },
    {
      "name": "Man Has Two Natures",
      "description": "We believe that every saved person possesses two natures: (a) that he has the old nature, inherited from the first Adam, for the duration of his earthly life; (b) that provision is made for victory of the new nature of Christ over the old nature through the power of the indwelling Holy Spirit.",
      "references": "Romans 7:15-25; Romans 6:11-14; Philippians 3:7-14: II Corinthians 12:7-10"
    },
    {
      "name": "Progressive Sanctification",
      "description": "We believe that sanctification for the believer is immediate upon acceptance of Christ as Savior, is progressive in the hearts and lives of believers through the presence and power of the Holy Spirit, and will be completed when we see Him.",
      "references": "I Corinthians 1:2; I Corinthians 6:11; Hebrews 10:10, 14; I Thessalonians 3:12, 13; I Thessalonians 4: 1-12; II Peter 3:18; Ephesians 4:11-16"
    },
    {
      "name": "In the World but Not of It",
      "description": "We believe that the saved are called into a life of separation from religious apostasy and from worldly and sinful practices and associations.",
      "references": "Romans 12:1, 2; I Thessalonians 5:22; I John 2:15-17; II Corinthians 6:14-18; Romans 16:17, 18; II John 7, 11; Ephesians 5:11"
    },
    {
      "name": "Universal & Local Church",
      "description": "We believe that the church exists in two aspects: First, it is an organism and is composed of all true believers in Jesus Christ as Savior. Ephesians 5:25-33; Colossians 1:14-18; I Corinthians 12:12-31. Second, it is an organization composed of regenerated, immersed believers, voluntarily united for the purpose of worship, edification, observance of the ordinances, fellowship and the establishment of Christian education and service; that among the necessary officers of the local church are pastors and deacons, whose qualifications and duties are clearly defined in the Scriptures; that the true mission of the church is the faithful witnessing of Christ to all men as we have opportunity in the local community and unto the uttermost parts of the earth; that the local church has the absolute right of self government, free from the interference of any hierarchy of individuals or organizations, religious or governmental; that the one and only true Head is Christ, through the Holy Spirit; that it is Scriptural for true churches to cooperate in contending for the faith and for the furtherance of the Gospel, with each local church as the sole judge of the measure and method of its cooperation; that on all matters of membership, policy of government, discipline and benevolence, the will of the local church is final.",
      "references": "Acts 2:41-47; Romans 1:7; Colossians 1:2; I Corinthians 1:2; Acts 4:4; Hebrews 10:25; Acts 20:7; Acts 11:26; Philippians 1:1; I Timothy 3:1-16; Titus 1:5-8; Hebrews 13:7, 17; I Peter 5:1-5; Acts 6:1-7; Matthew 28:18-20; Acts 1:8; Ephesians 1:22,23; Colossians 1:18; Ephesians 5:23-26; Acts 15:1-27; Acts 11:29,30; Acts 13:1-4; Philippians 4:14-16; Acts 20:28,31; I Corinthians 5:1-6,11"
    },
    {
      "name": "Baptism by Immersion",
      "description": "We believe that Scriptural baptism is the immersion of a believer in water, setting forth, in symbol, his union with Christ in His death, burial and resurrection; that every believer should be baptized because of the example and command of our Lord; and that while there is no saving power in water baptism, it is an act of obedience by those who are already saved to picture their death, burial and resurrection to walk in newness of life with Jesus Christ, and that blessed hope of bodily resurrection.",
      "references": "Romans 6:3-5; Matthew 3:13-17; Matthew 28:19, 20; Acts 8:36-39; Ephesians 2:8, 9; Titus 3:5; John 5:24"
    },
    {
      "name": "Lord's Supper",
      "description": "We believe that the Lord’s Supper is a commemoration of the Lord’s death until He comes again, and that, in this ordinance, the Lord’s Table should be opened to all regenerated persons after self-examination.",
      "references": "I Corinthians 11:24-32; Luke 22:14-20"
    },
    {
      "name": "Pre-Tribulation Rapture",
      "description": "We believe in the literal, bodily, personal, pre-millennial and imminent coming of our Lord in the air to catch away all believers unto Himself before the Tribulation period; also, in the personal, visible and glorious return of Christ to the earth, with believers, at the close of the Tribulation period to judge the living nations and to set up His Millennial Kingdom on earth.",
      "references": "Acts 1:11; John 14:3; I Thessalonians 4:13-18; II Peter 3:1-13; Revelation 4:1; Matthew 24:42-44; II Thessalonians 2:7, 8; Matthew 24:29-31; Revelation 19:11-21; Matthew 25:31-46: Revelation 20:1-6; Hebrews 12:22-24"
    },
    {
      "name": "Satan",
      "description": "We believe that Satan, a fallen angel, is a distinct and real personality, the god of this age, the adversary of Christ and all believers, and that his destiny is eternal punishment in the Lake of Fire.",
      "references": "Ezekiel 28:1-19; Job 1:6-9; I Peter 5:8; Matthew 4:1-11; I Timothy 3:7; James 4:7; II Corinthians 4:4; Revelation 20:10"
    },
    {
      "name": "Life After Death",
      "description": "We believe that all the souls of the redeemed are, at death, absent from the body and present with the Lord, where in conscious bliss they await the first resurrection; and that the souls of the lost remain after death in conscious misery in Hell until the second resurrection.",
      "references": "II Corinthians 5:6-8; Philippians 1:23, 24; Luke 16:19-31; II Peter 2:9; Revelation 20:13-15"
    },
    {
      "name": "Christ's Return",
      "description": "We believe the Son of Man shall come in the Glory of His Father, and then He shall reward every man according to his works.",
      "references": "Matthew 16:27; II Corinthians 5:10; Psalm 58:11"
    },
    {
      "name": "Sunday Worship",
      "description": "We believe that in this Age of Grace, the Lord’s Day, which is the first day of the week, the day of our Lord’s resurrection, is the proper day for Christian worship and service; and that it ought to be kept sacred to spiritual purposes by abstinence from all unnecessary secular labor and other activities unbecoming to such a day.",
      "references": "Acts 20:7; I Corinthians 16:1,2; Colossians 2:13-17; Hebrews 10:25; John 20:1, 19,26; Mark 16:2; Matthew 28:1; Luke 24:1"
    },
    {
      "name": "God's Future Plans for Israel",
      "description": "We believe that God’s covenant people, Israel, shall be regathered to Palestine from their world-wide dispersion, redeemed, and under the personal and millennial reign of Christ upon David’s throne in Jerusalem shall become the head of nations.",
      "references": "Genesis 3:15; Genesis 12:2,3; Genesis 13:14,15; Jeremiah 7:7; Deuteronomy 28:63-66; Deuteronomy 30:1-6; Ezekiel 36:22-28; 37:11-28; Romans 11:25-27; Luke 1:30-33; Jeremiah 23:3-6; 33:14-17; Acts 3:19-21; Revelation 20:4-6"
    },
    {
      "name": "Civil Government is God Ordained",
      "description": "We believe that civil government is of divine appointment, for the interest and good order of human society; and that those in authority are to be prayed for, conscientiously honored and obeyed, except only in things opposed to the direct and revealed will of our Lord Jesus Christ.",
      "references": "Romans 13:1-7; Genesis 9:5, 6; I Timothy 2:2, 3; Acts 4:19, 20; Acts 5:27-29"
    },
    {
      "name": "Bodily Resurrection of the Dead",
      "description": "We believe in the bodily resurrection of the dead–the saved to everlasting blessedness at the coming of Christ, and (one thousand years later) the lost to the judgment at the Great White Throne and then to everlasting, conscious punishment in the Lake of Fire.",
      "references": "John 5:21-30; I Thessalonians 4:13-18; I Corinthians 15:42-52; Philippians 3:20, 21; Revelation 20:5, 6, 11-15"
    }
  ]
}